package com.company;

public class Main {

    public static void main(String[] args) {
        Address a = new Address(Country.Bulgaria, "Sofia", "Hemus", 1, 120);
        User peho = new User("Peter", "Damianov", a);
        System.out.println(peho.hashCode());
        System.out.println(peho.getId());
    }
}
/*Да се напише програма за електронен магазин.
Да се използват основно(само) map и set
Всеки електронен магазин има артикули и наличност от тях.
Електронния магазин се намира в определена държава(enum) и има списък от държави до които доставя.

Всеки артикул се характеризира с ID, име, цена, мерна единица (enum).

За да пазаруваш в електронния магазин може да си регистриран потребител или гост.
Всеки потребител се характеризира с ID, 2 имена и адрес за доставка.
Адреса за доставка се състои от Държава (enum), Град, Улица + номер и номер на апартамент.

Магазина има кошница с артикули.

Магазина трябва и да пази списък с поръчки.
Поръчките се характеризират с ID, ID на потребителя за който е поръчката, КОПИЕ на адреса за доставка,
статус (enum: Open, Shipped, Completed, Failed) и списък с поръчаните артикули, количества и цена към момента на поръчката.

Магазина има 1 активна кошница и 1 активен потребител.

Магазина трябва да има следните методи:

Да се напишат UNIT тестове. */
